megamind4089/qmk_nrf52/tmk_core/protocol/nrf/sdk15/ble_master.c
void ble_send_mouse(report_mouse_t *report) {
  if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
    return;
  }

  uint32_t err_code;
  if (!m_in_boot_mode) {
    err_code = ble_hids_inp_rep_send(&m_hids_composite,
        COMPOSITE_REPORT_INDEX_MOUSE, 5, (uint8_t*)report, m_conn_handle);
    NRF_LOG_DEBUG("mouse normal report send\r\n");
  } else {
    err_code = ble_hids_boot_mouse_inp_rep_send(&m_hids_composite,
        report->buttons, report->x, report->y, 0, NULL, m_conn_handle);
    NRF_LOG_DEBUG("mouse boot report send\r\n");
  }
//    APP_ERROR_CHECK(err_code);
  if (err_code != NRF_SUCCESS) {
    NRF_LOG_ERROR("mouse send error\r\n");
  }
}

#else /* MOUSE_ENABLE */
void ble_send_mouse(report_mouse_t *report) {
  (void) report;
}
#endif /* MOUSE_ENABLE */

/* ---------------------------------------------------------
 *                   Extrakey functions
 * ---------------------------------------------------------
 */

#ifdef EXTRAKEY_ENABLE
static void ble_send_extra_report(uint8_t report_id, uint16_t data) {
  if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
    return;
  }
  uint32_t err_code = ble_hids_inp_rep_send(&m_hids_composite,
      report_id, 2, (uint8_t*)&data, m_conn_handle);
  if (err_code != NRF_SUCCESS) {
    NRF_LOG_ERROR("extra send error\r\n");
  }
}

void ble_send_system(uint16_t data) {
  ble_send_extra_report(COMPOSITE_REPORT_INDEX_SYSTEM, data);
}

void ble_send_consumer(uint16_t data) {
  ble_send_extra_report(COMPOSITE_REPORT_INDEX_CONSUMER, data);
}

#else /* EXTRAKEY_ENABLE */
void ble_send_system(uint16_t data) {
  (void) data;
}
void ble_send_consumer(uint16_t data) {
  (void) data;
}
#endif /* EXTRAKEY_ENABLE */

/* ---------------------------------------------------------
 *                   Console functions
 * ---------------------------------------------------------
 */

#ifdef CONSOLE_ENABLE

int8_t sendchar(uint8_t c) {
  // The previous implmentation had timeouts, but I think it's better to just slow down
  // and make sure that everything is transferred, rather than dropping stuff
//  return chnWrite(&drivers.console_driver.driver, &c, 1);
  return 0;
}

// Just a dummy function for now, this could be exposed as a weak function
// Or connected to the actual QMK console
//static void console_receive( uint8_t *data, uint8_t length ) {
//  (void)data;
//  (void)length;
//}

void console_task(void) {
//  uint8_t buffer[CONSOLE_EPSIZE];
//  size_t size = 0;
//  do {
//    size_t size = chnReadTimeout(&drivers.console_driver.driver, buffer, sizeof(buffer), TIME_IMMEDIATE);
//    if (size > 0) {
//        console_receive(buffer, size);
//    }
//  } while(size > 0);
}

#else /* CONSOLE_ENABLE */
int8_t sendchar(uint8_t c) {
  (void) c;
  return 0;
}
#endif /* CONSOLE_ENABLE */

void sendchar_pf(void *p, char c) {
  (void) p;
  sendchar((uint8_t) c);
}

void main_task_start(uint8_t interval_ms) {
  uint32_t err_code = app_timer_start(main_task_timer_id, APP_TIMER_TICKS(interval_ms),
      NULL);
  APP_ERROR_CHECK(err_code);
}

void restart_advertising_wo_whitelist() {
  uint32_t err_code;

  sd_ble_gap_adv_stop(m_advertising.adv_handle);

#if defined(NRF_SEPARATE_KEYBOARD_MASTER)
  scan_start();
#endif

  ble_adv_modes_config_t options;
  memset(&options, 0, sizeof(options));
  options.ble_adv_whitelist_enabled = false;
  options.ble_adv_directed_high_duty_enabled = false;
  options.ble_adv_directed_enabled = false;
  options.ble_adv_fast_enabled = true;
  options.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
  options.ble_adv_fast_timeout = APP_ADV_FAST_DURATION;
  options.ble_adv_slow_enabled = true;
  options.ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
  options.ble_adv_slow_timeout = APP_ADV_SLOW_DURATION;
  ble_advertising_modes_config_set(&m_advertising, &options);

  if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
    err_code = sd_ble_gap_disconnect(m_conn_handle,
    BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_ERROR_INVALID_STATE) {
      APP_ERROR_CHECK(err_code);
    }
  } else {
    err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
  }

  if (err_code != NRF_ERROR_INVALID_STATE) {
    APP_ERROR_CHECK(err_code);
  }
}

void restart_advertising_id(uint8_t id) {
  ret_code_t ret;

  if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
    ble_adv_modes_config_t options;
    memset(&options, 0, sizeof(options));
    options.ble_adv_whitelist_enabled = true;
    options.ble_adv_directed_high_duty_enabled = false;
    options.ble_adv_directed_enabled = false;
    options.ble_adv_fast_enabled = true;
    options.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
    options.ble_adv_fast_timeout = APP_ADV_FAST_DURATION;
    options.ble_adv_slow_enabled = true;
    options.ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
    options.ble_adv_slow_timeout = APP_ADV_SLOW_DURATION;
    ble_advertising_modes_config_set(&m_advertising, &options);

    ret = sd_ble_gap_disconnect(m_conn_handle,
        BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (ret != NRF_ERROR_INVALID_STATE) {
      APP_ERROR_CHECK(ret);
    }
  }
  sd_ble_gap_adv_stop(m_advertising.adv_handle);

#ifdef NRF_SEPARATE_KEYBOARD_MASTER
  sd_ble_gap_scan_stop();
#endif

  memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
  m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));

  peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);
  if (id >= m_whitelist_peer_cnt) {
    return;
  }
#ifdef NRF_SEPARATE_KEYBOARD_MASTER
  if (id == 0) {
    return;
  }
  m_whitelist_peer_cnt = 2;
  m_whitelist_peers[1] = m_whitelist_peers[id];
#else
  m_whitelist_peer_cnt = 1;
  m_whitelist_peers[0] = m_whitelist_peers[id];
#endif

  ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
  APP_ERROR_CHECK(ret);

  ret = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
  if (ret != NRF_ERROR_NOT_SUPPORTED) {
    APP_ERROR_CHECK(ret);
  }

#ifdef NRF_SEPARATE_KEYBOARD_MASTER
  scan_start();
#endif

  ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

//  APP_ERROR_CHECK(ret);
}


static bool enable_ble_send = true;
static bool enable_usb_send = false;

bool get_ble_enabled () { return enable_ble_send; }
void set_ble_enabled (bool enabled) { enable_ble_send = enabled; }
bool get_usb_enabled () { return enable_usb_send; }
void set_usb_enabled (bool enabled) { enable_usb_send = enabled; }
void select_ble() {
  enable_ble_send = true;
  enable_usb_send = false;
}
void select_usb() {
  enable_ble_send = false;
  enable_usb_send = true;
}
/**
 * @}
 */
